In [1]:
import pandas as pd
import numpy as np

In [2]:
##series 객체를 생성할 때 pd.series()
series = pd.Series (['하나','둘','셋'],index = range(1,4))
series

1    하나
2     둘
3     셋
dtype: object

In [3]:
a = pd.Series([9_904_312,3_448_737,2_890_451,2_466_052],index = ['서울','부산','인천','대구'])
a

서울    9904312
부산    3448737
인천    2890451
대구    2466052
dtype: int64

In [4]:
num = pd.Series(range(10,100,10))
num

0    10
1    20
2    30
3    40
4    50
5    60
6    70
7    80
8    90
dtype: int64

In [5]:
a.index  #Series의 index 속성 -> str이 아닌 수정가능한 더 큰 범위의 object로 지정됨

Index(['서울', '부산', '인천', '대구'], dtype='object')

In [6]:
a.values

array([9904312, 3448737, 2890451, 2466052], dtype=int64)

In [7]:
#num데이터에서 50 이상인 데이터의 수

sum(num.values > 50)

4

In [8]:
a.name = '인구'
a.index.name = '도시'
a

도시
서울    9904312
부산    3448737
인천    2890451
대구    2466052
Name: 인구, dtype: int64

In [9]:
#dict 데이터로 Series생성

d = {'a':1,'b':2,'c':3}
pd.Series(data = d, index = ['c','a','b'])   # 순서는 상관 X ( dict - 비시퀀스 자료형)

c    3
a    1
b    2
dtype: int64

In [10]:
#키 값과 인덱스는 동일하게 작성

#다르게 작성하면 Series 객체의 값이 NaN으로 출력 
#NaN 값은 float 자료형에서만 표현 가능하므로 결과가 float 자료형으로 됨
d = {'a':1,'b':2,'c':3}
pd.Series(data = d, index = ['c','a','b1'])

c     3.0
a     1.0
b1    NaN
dtype: float64

In [11]:
test = pd.Series([88,95,100,67],index=['철수','영희','길동','몽룡'])
test.name = '사회점수'
test.index.name = '이름'
test

이름
철수     88
영희     95
길동    100
몽룡     67
Name: 사회점수, dtype: int64

In [12]:
#index를 속성처럼 활용
#index label이 속성 / index가 빈칸없는 문자열인 경우 .index 로 값에 접근 가능

a.서울

9904312

In [13]:
#Series 객체는 index label를 키(key)로 사용
#in 연산 . item()메서드 사용 가능

'서울' in a   #인덱스 레이블 중에 서울이 있는가

True

In [14]:
9_904_312 in a.values

True

In [15]:
for k , v in a.items() :
    if v >= 3000000:
        print(f'{k}의 인구는 300만이 넘습니다.')

서울의 인구는 300만이 넘습니다.
부산의 인구는 300만이 넘습니다.

In [16]:
##Series의 벡터화 연산
#index는 변하지 않고 value에만 적용

a / 1000000

도시
서울    9.904312
부산    3.448737
인천    2.890451
대구    2.466052
Name: 인구, dtype: float64

In [17]:
##Series의 인덱싱
    #1. [] index 방법
    #2. index label 이용하는 방법
    #3. .index 방법 

a[1],a['부산']  #값만

(3448737, 3448737)

In [18]:
#Series 형태로 인덱싱 

a[['서울','대구']]
a[[0,3,1]]
a[['인천']]

도시
인천    2890451
Name: 인구, dtype: int64

In [19]:
##Series의 슬라이싱
#문자열의 슬라이싱은 :(콜론)뒤의 값도 결과에 포함됨에 주의!

a['부산':'대구']  #대구 포함

a[1:3]  #3 미포함

도시
부산    3448737
인천    2890451
Name: 인구, dtype: int64

In [20]:
##Series index 기반 연산
#index끼리 value 연산함

a1 =pd.Series({'서울':9631482,'부산':3393191,'인천':2632035,'대전':1490158})
a1

da = a - a1 
da

#a에는 대전의 값 X , a1에는 대구의 값 X
#nan 값의 연산은 NaN 출력

대구         NaN
대전         NaN
부산     55546.0
서울    272830.0
인천    258416.0
dtype: float64

In [21]:
##isnull
#NaN값 확인 
    #True - NaN 

da.isnull()

대구     True
대전     True
부산    False
서울    False
인천    False
dtype: bool

In [22]:
##notnull
#NaN이 아닌 값 확인 
    #True - NaN 아님 / False - Nan

da.notnull()

da[da.notnull()]   # booltype indexing / True값만 출력

부산     55546.0
서울    272830.0
인천    258416.0
dtype: float64

In [23]:
#2010년 대비 2015년 인구증가율

a     #2015년 
a1    #2010년

ra = (a -a1) /a1 * 100
ra = ra[ra.notnull()]
ra

부산    1.636984
서울    2.832690
인천    9.818107
dtype: float64

In [24]:
ra1 = (a - a1) 

ra1 = ra1[ra1.notnull()]
ra1

ra1[[ra1.argmax()]]

서울    272830.0
dtype: float64

In [25]:
##Series 데이터 갱신

ra[1:3] = [2.83,9.82]
ra

부산    1.636984
서울    2.830000
인천    9.820000
dtype: float64

In [26]:
##Series 데이터 추가

ra['대구'] = 1.41
ra

부산    1.636984
서울    2.830000
인천    9.820000
대구    1.410000
dtype: float64

In [27]:
ra

부산    1.636984
서울    2.830000
인천    9.820000
대구    1.410000
dtype: float64

In [28]:
##Series 데이터 삭제

del ra['서울']
ra

부산    1.636984
인천    9.820000
대구    1.410000
dtype: float64

In [29]:
#Series 객체 생성 연습문제

fin1 = {'카카오':60010,'삼성전자' : 61000, 'LG전자':90000}
fin2_values = [60200,61200,200100]
fin2_index = ['카카오','삼성전자','네이버']

ser_finance1 = pd.Series(fin1)
ser_finance2 = pd.Series(fin2_values,index=fin2_index)

ser_finance1

카카오     60010
삼성전자    61000
LG전자    90000
dtype: int64

In [30]:
ser_finance2

카카오      60200
삼성전자     61200
네이버     200100
dtype: int64

In [31]:
ser_finance1 - ser_finance2

LG전자      NaN
네이버       NaN
삼성전자   -200.0
카카오    -190.0
dtype: float64

In [32]:
ser_finance1 + ser_finance2

LG전자         NaN
네이버          NaN
삼성전자    122200.0
카카오     120210.0
dtype: float64

In [33]:
ser_finance1 * ser_finance2

LG전자             NaN
네이버              NaN
삼성전자    3.733200e+09
카카오     3.612602e+09
dtype: float64

In [34]:
ser_finance1 / ser_finance2

LG전자         NaN
네이버          NaN
삼성전자    0.996732
카카오     0.996844
dtype: float64

In [35]:
#정수끼리의 연산인데 int가 아니라 flaot인 이유
    # type(np.nan) = float , int와 flaot 자료가 있으면 array에서는 더 큰 범위인 float로 생성 됨

In [36]:
result = ser_finance1 - ser_finance2
result[result.notnull()]

삼성전자   -200.0
카카오    -190.0
dtype: float64

In [37]:
##DataFrame class

#산숳 연산은 row와 column 모두 적용
#Series객체를 갖는 dictionary
    #dict -> key : values(Series)  // Series 속에도 key : value 이므로 DataFrame에서 key는 Series의 index가 됨

#생성 과정
    #1.하나의 열이 되는 데이터를 일차원 배열, 리스트로 준비
    #2.각 열에 대한 이름(label)을 키로 만드는 딕셔너리 생성
    #3.이 데이터를 DataFrame 생성자에 넣기 / 생성자 - 해당 객체를 만들어줌
    #  DataFrame(data = , column = 열방향 index , index = 행방향 index)

In [38]:
#Series 와 DataFrame

#Series : 1차원 벡터 데이터에 index를 붙임
#DataFrame : 2차원 벡터 데이터에 row/column index를 붙임

In [39]:
data = {
    "2015" : [9904312, 3448737, 2890451, 2466052],
    "2010" : [9631482, 3393191, 2632035, 2431774],
    "2005" : [9762546, 3512547, 2517680, 2456016],
    "2000" : [9853972, 3655437, 2466338, 2473990],
    "지역" : ["수도권", "경상권", "수도권", "경상권"],
    "2010-2015 증가율" :[0.0283, 0.0163, 0.0982, 0.0141]
}
columns = ["지역", "2015", "2010", "2005", "2000", "2010-2015 증가율"]
index = ["서울", "부산", "인천", "대구"]
df = pd.DataFrame(data, index = index, columns = columns)
df

     지역     2015     2010     2005     2000  2010-2015 증가율
서울  수도권  9904312  9631482  9762546  9853972         0.0283
부산  경상권  3448737  3393191  3512547  3655437         0.0163
인천  수도권  2890451  2632035  2517680  2466338         0.0982
대구  경상권  2466052  2431774  2456016  2473990         0.0141

In [40]:
#DataFrame의 속성

#.values : 데이터만
df.values

#.index : roW index
df.index

#.columns : columns index
df.columns

Index(['지역', '2015', '2010', '2005', '2000', '2010-2015 증가율'], dtype='object')

In [41]:
#DataFrame 갱신

#'2010-2015 증가율' 열의 값 갱신
df['2010-2015 증가율'] = df['2010-2015 증가율'] * 100
df

     지역     2015     2010     2005     2000  2010-2015 증가율
서울  수도권  9904312  9631482  9762546  9853972           2.83
부산  경상권  3448737  3393191  3512547  3655437           1.63
인천  수도권  2890451  2632035  2517680  2466338           9.82
대구  경상권  2466052  2431774  2456016  2473990           1.41

In [42]:
#DataFrame 추가

df['2005-2010 증가율'] = ((df['2010']-df['2005']) / df['2005'] * 100 ) .round(2) 
df

     지역     2015     2010     2005     2000  2010-2015 증가율  2005-2010 증가율
서울  수도권  9904312  9631482  9762546  9853972           2.83          -1.34
부산  경상권  3448737  3393191  3512547  3655437           1.63          -3.40
인천  수도권  2890451  2632035  2517680  2466338           9.82           4.54
대구  경상권  2466052  2431774  2456016  2473990           1.41          -0.99

In [43]:
#DataFrame 삭제

del df['2010-2015 증가율']
df

     지역     2015     2010     2005     2000  2005-2010 증가율
서울  수도권  9904312  9631482  9762546  9853972          -1.34
부산  경상권  3448737  3393191  3512547  3655437          -3.40
인천  수도권  2890451  2632035  2517680  2466338           4.54
대구  경상권  2466052  2431774  2456016  2473990          -0.99

In [44]:
df.index.name = '도시'
df.columns.name = '특성'
df

특성   지역     2015     2010     2005     2000  2005-2010 증가율
도시
서울  수도권  9904312  9631482  9762546  9853972          -1.34
부산  경상권  3448737  3393191  3512547  3655437          -3.40
인천  수도권  2890451  2632035  2517680  2466338           4.54
대구  경상권  2466052  2431774  2456016  2473990          -0.99

In [45]:
data = {'연도' : [2011,2012,2013,2014,2015],
        '온실가스직접배출' :[626,637,704,707,654],
        '온실가스간접배출':[152351,153873,154391,153656,153001],
        '연료사용량':[8.9,8.9,9.1,9.3,8.5],
        '전기사용량':[2941,3168,3179,3164,3150]}
columns = ['연도','온실가스직접배출','온실가스간접배출','연료사용량','전기사용량']
index = [0,1,2,3,4]
df2 = pd.DataFrame(data, columns = columns, index=index)
df2

     연도  온실가스직접배출  온실가스간접배출  연료사용량  전기사용량
0  2011       626    152351    8.9   2941
1  2012       637    153873    8.9   3168
2  2013       704    154391    9.1   3179
3  2014       707    153656    9.3   3164
4  2015       654    153001    8.5   3150

In [46]:
##DataFrame 인덱싱
#column label을 키로 생각하고 인덱싱

#2010이라는 column을 반환하면서 Series  자료형으로 반환
df['2010']

#리스트로 여러개의 column을 인덱싱하면 DataFrame 형태로 반환
df[['2010','2015']]

특성     2010     2015
도시
서울  9631482  9904312
부산  3393191  3448737
인천  2632035  2890451
대구  2431774  2466052

In [47]:
#하나의 열만 인덱싱 해도 DataFrame으로 반환하고자 할 때
#요소가 하나인 리스트 자료형으로 인덱싱

df[['2010']]

특성     2010
도시
서울  9631482
부산  3393191
인천  2632035
대구  2431774

In [48]:
#인덱싱은 column!

df2 = pd.DataFrame(np.arange(12).reshape(3,4))
df2

df2[2]   # row가 아닌 column의 2로 인덱싱

0     2
1     6
2    10
Name: 2, dtype: int32

In [49]:
##row 슬라이싱
#row에 대한 접근은 슬라이싱만 가능! (인덱싱 X)

df
df[:1]  # = df[:'서울']
df[1:2] #=df['부산':'부산']

특성   지역     2015     2010     2005     2000  2005-2010 증가율
도시
부산  경상권  3448737  3393191  3512547  3655437           -3.4

In [50]:
#column label로 인덱싱하면 Series 반환
#Series를 row label로 인덱싱 하면 개별 데이터 값으로 반환

df['2015']['서울']

type(df['2015'])               #Series
type(df['2015']['서울'])        #int

numpy.int64

In [51]:
#연습문제
data = {
    '국어' : [80,90,70,30],
    '영어' : [90,70,60,40],
    '수학' : [90,60,80,70]
}
columns = ['국어','영어','수학']
index = ['춘향','몽룡','향단','방자']
df = pd.DataFrame(data,columns = columns , index = index)
df

    국어  영어  수학
춘향  80  90  90
몽룡  90  70  60
향단  70  60  80
방자  30  40  70

In [52]:
df['수학']

춘향    90
몽룡    60
향단    80
방자    70
Name: 수학, dtype: int64

In [53]:
df[['영어','수학']]

    영어  수학
춘향  90  90
몽룡  70  60
향단  60  80
방자  40  70

In [54]:
df['평균'] = round((df['국어']+df['영어']+df['수학'])/3, 2)
df

    국어  영어  수학     평균
춘향  80  90  90  86.67
몽룡  90  70  60  73.33
향단  70  60  80  70.00
방자  30  40  70  46.67

In [55]:
df[:1]

    국어  영어  수학     평균
춘향  80  90  90  86.67

In [56]:
df.T['향단']

국어    70.0
영어    60.0
수학    80.0
평균    70.0
Name: 향단, dtype: float64

In [57]:
np.random.seed(0)
data = np.random.randn(6,4)
columns = ['A','B','C','D']
index = pd.date_range('20130226',periods=6)

pd.DataFrame(data,index=index,columns=columns)

                   A         B         C         D
2013-02-26  1.764052  0.400157  0.978738  2.240893
2013-02-27  1.867558 -0.977278  0.950088 -0.151357
2013-02-28 -0.103219  0.410599  0.144044  1.454274
2013-03-01  0.761038  0.121675  0.443863  0.333674
2013-03-02  1.494079 -0.205158  0.313068 -0.854096
2013-03-03 -2.552990  0.653619  0.864436 -0.742165